Repository: yoomoney/yookassa-payments-swift
Catalog: YooKassaPayments/Public/Resources/*.lproj/Localizable.strings
Languages: ru

# ApplePayContract.SavePaymentMethod.Title
source: Allow to write off money
ru: Разрешить списывать деньги

# ApplePayContract.fee
source: Commission
ru: Комиссия

# ApplePayContract.paymentMethodTitle
source: You'll be redirected into the Apple Pay app: confirm the payment
ru: Дальше откроем Apple Pay — подтвердите оплату

# ApplePayUnavailable.title
source: Apple Pay is unavailable
ru: Apple Pay недоступен

# BankCard.savePaymentMethod.title
source: Link a card
ru: Привязать карту

# BankCardDataInput.navigationBarTitle
source: Bank card
ru: Банковская карта

# BankCardDataInputView.BottomHint.invalidCvc
source: Check CVC
ru: Проверьте CVC

# BankCardDataInputView.BottomHint.invalidExpiry
source: Check the month and date
ru: Проверьте месяц и год

# BankCardDataInputView.BottomHint.invalidPan
source: Check the card number
ru: Проверьте номер карты

# BankCardRepeat.savePaymentMethod.title
source: Link a card
ru: Привязать карту

# BankCardRepeat.title
source: Saved card
ru: Сохраненная карта

# BankCardView.inputCvcHint
source: Code
ru: Код

# BankCardView.inputExpiryDateHint
source: Expiration date
ru: Срок действия

# BankCardView.inputExpiryDatePlaceholder
source: MM/YY
ru: ММ/ГГ

# BankCardView.inputPanHint
source: Card number
ru: Номер карты

# BankCardView.inputPanPlaceholder
source: Enter or scan
ru: Введите или отсканируйте

# Common.Error.unknown
source: Something went wrong
ru: Что то пошло не так

# Common.PlaceholderView.buttonTitle
source: Try again
ru: Повторить

# Common.PlaceholderView.text
source: Please try again later.
ru: Попробуйте повторить чуть позже.

# Common.button.cancel
source: Cancel
ru: Отменить

# Contract.Sberbank.PhoneInput.BottomHint
source: For the text message from Sberbank with the payment code
ru: Для смс от Сбербанка с кодом для оплаты

# Contract.Sberbank.PhoneInput.Title
source: Phone number in Sberbank Online
ru: Номер в Сбербанк Онлайн

# Contract.fee
source: Including commission
ru: Включая комиссию

# Contract.format.saveAuthInApp
source: Next time, you won't have to sign in to your YooMoney account, which will make payments faster
ru: В следующий раз не придётся входить в профиль ЮMoney — можно будет оплатить быстрее

# Contract.format.saveAuthInApp.title
source: Remember me
ru: Запомнить меня

# Contract.logout
source: Sign out
ru: Выйти

# Contract.next
source: Next
ru: Продолжить

# Contract.placeholder.smsCode
source: Enter text message code
ru: Введите код из смс

# Contract.resendSms
source: Send again
ru: Отправить снова

# Error.ApplePayStrategy.failTokenizeData
source: An error occurred during ApplePay tokenization
ru: В процессе токенизации ApplePay произошла ошибка

# Error.emptyPaymentOptions
source: No available payment methods
ru: Нет доступных способов оплаты

# Error.endedAttemptsToEnterStartOver
source: Too many attempts. Try again later
ru: Слишком много попыток. Попробуйте позже

# Error.internet
source: Connection error. Try again once you're online.
ru: Проблема с интернетом. Попробуйте еще раз, когда будете онлайн

# Error.noWalletTitle
source: Wallet payment is not available
ru: Оплата кошельком недоступна

# Error.resendAuthCodeAndStartOver
source: Error, try again
ru: Не получилось, попробуйте заново

# LinkedCard.title
source: Linked card
ru: Привязанная карта

# LogoutConfirmation.format.title
source: Are you sure you want to sign out of account '%@'?
ru: Уверены, что хотите выйти из аккаунта '%@'?

# PaymentAuthorization.description.witPhone
source: We sent a verification code to %@
ru: Отправили проверочный код на %@

# PaymentAuthorization.description.withoutPhone
source: We sent a verification code
ru: Отправили проверочный код

# PaymentAuthorization.invalidAnswer
source: Invalid code. Double-check and try again
ru: Это не тот код. Проверьте и введите ещё раз

# PaymentAuthorization.invalidAnswer.sessionsLeft
source: Invalid code. Attempts left: %d
ru: Это не тот код. Осталось попыток: %d

# PaymentAuthorization.remainingTime
source: Get a new code in %@
ru: Получить новый код через %@

# PaymentAuthorization.verifyAttemptsExceeded
source: No attempts left
ru: Попытки закончились

# PaymentAuthorization.verifyAttemptsExceeded.nextSession
source: No attempts left. You can try %@
ru: Попытки закончились. Попробовать можно %@

# PaymentMethod.bankCard
source: Bank card
ru: Банковская карта

# PaymentMethod.wallet
source: YooMoney
ru: ЮMoney

# PaymentMethods.paymentMethods
source: Payment method
ru: Способ оплаты

# SavePaymentMethod.BankCard.Force.Text
source: After the payment, the card will be linked, so that
ru: После оплаты привяжем карту, чтобы

# SavePaymentMethod.BankCard.Force.hyperText
source: money could be debited upon store's request
ru: списывать деньги по запросу магазина

# SavePaymentMethod.BankCard.UserPriority.Text
source: Link the card and
ru: Привязать карту и

# SavePaymentMethod.BankCard.UserPriority.hyperText
source: debit money upon store's request
ru: списывать деньги по запросу магазина

# SavePaymentMethod.Wallet.Force.Text
source: After the payment, the wallet will be linked: the store will be able
ru: После оплаты привяжем кошелёк: магазин сможет

# SavePaymentMethod.Wallet.Force.hyperText
source: to debit money without your participation
ru: списывать деньги без вашего участия

# SavePaymentMethod.Wallet.UserPriority.Text
source: Allow the store
ru: Разрешить магазину

# SavePaymentMethod.Wallet.UserPriority.hyperText
source: to debit money without my participation
ru: списывать деньги без моего участия

# SavePaymentMethodInfo.BankCard.Body
source: It means that you're allowing YooMoney to debit money upon store's request without an additional confirmation from you, from this card or a new one in case it's reissued (if your bank can update the details automatically). You can cancel linking at any moment via store's support service.
ru: Это значит, что вы разрешаете ЮMoney списывать деньги по запросу магазина без отдельного подтверждения — с этой карты или с новой, при перевыпуске (если ваш банк умеет автоматически обновлять данные).\n\nОтменить привязку можно в любой момент — через службу поддержки магазина.

# SavePaymentMethodInfo.BankCard.Header
source: Permission to debit money upon store's request
ru: Разрешение списывать деньги по запросу магазина

# SavePaymentMethodInfo.Button.GotIt
source: Got it
ru: Понятно

# SavePaymentMethodInfo.Wallet.Body
source: It means that you're allowing YooMoney to debit money from the wallet upon store's request without an additional confirmation from you. You can cancel these autopayments at any moment in the wallet settings (on the YooMoney website).
ru: Это значит, что вы разрешаете ЮMoney списывать деньги с кошелька по запросу магазина — без дополнительного подтверждения с вашей стороны. Отменить такие списания можно в любой момент — в настройках кошелька (на сайте ЮMoney).

# SavePaymentMethodInfo.Wallet.Header
source: Permission to debit money without your participation
ru: Разрешение списывать деньги без вашего участия

# Sberpay.paymentMethodTitle
source: Next, open the Sberbank Online application - confirm the payment
ru: Дальше откроем приложение Сбербанк Онлайн — подтвердите оплату

# TermsOfService.Hyperlink
source: the terms and conditions of the service
ru: условия сервиса

# TermsOfService.Text
source: By clicking this button, accept
ru: Нажимая кнопку, вы принимаете

# Wallet.Authorization.addEmailTitle
source: For receipts and notifications
ru: Для чеков и уведомлений

# Wallet.Authorization.emailCheckboxTitle
source: I'd like to receive news about the service, discounts, and surveys: not more than once a week
ru: Хочу получать новости сервиса, скидки, опросы: максимум раз в неделю

# Wallet.Authorization.hardMigrationScreenButtonSubtitle
source: It doesn't change any limits, commission rates, or other terms of use of the wallet in any way: <a href="https://new.yoomoney.ru/">learn more</a>
ru: На лимиты, комиссии и остальные условия использования кошелька это никак не влияет: <a href=\"https://new.yoomoney.ru/\">вот подробности </a>

# Wallet.Authorization.hardMigrationScreenSubtitle
source: You used to sign in to your wallet using your Yandex username and password, now you need a YooMoney account instead. Let us help you get it: — sign in using your Yandex username and password, — allow YooMoney to access your name and email address, — create a new password. You'll get a YooMoney account with the same wallet that you've had in it. Email address and password are used for signing in, and text message codes are used for confirming actions.
ru: Раньше вы заходили в кошелёк с логином и паролем Яндекса, теперь нужен профиль ЮMoney.\nСейчас поможем его получить:\n\n— вы зайдёте с логином и паролем Яндекса,\n— разрешите ЮMoney доступ к имени и почте,\n— придумаете новый пароль.\n\nУ вас появится профиль ЮMoney с прежним кошельком внутри.\nДля входа — почта и пароль, для подтверждений — смс-коды.

# Wallet.Authorization.hardMigrationScreenTitle
source: Time to switch to YooMoney
ru: Пора перейти в ЮMoney

# Wallet.Authorization.migrationBannerButtonText
source: Learn more
ru: Подробнее

# Wallet.Authorization.migrationBannerText
source: If you signed up before October 21, you need to switch to YooMoney
ru: Если вы регистрировались до 21 октября — нужно перейти в ЮMoney

# Wallet.Authorization.migrationScreenButtonSubtitle
source: It doesn't change any limits, commission rates, or other terms of use of the wallet in any way: <a href="https://new.yoomoney.ru">learn more</a>
ru: На лимиты, комиссии и остальные условия использования кошелька это никак не влияет: <a href=\"https://new.yoomoney.ru\">вот подробности</a>

# Wallet.Authorization.migrationScreenSubtitle
source: Your wallet is now in YooMoney, separate from your Yandex account. — What remains as it was before: your wallet number, settings configuration, and terms of use. — What's changed: you'll use your email address or phone number instead of your username (like in Yandex). You can also update your password. — What you need to do now: sign in to your Yandex account, under which you have your wallet.
ru: Потому что теперь кошелёк — в ЮMoney, отдельно от аккаунта в Яндексе.\n\n— Что останется как раньше: номер кошелька, ваши настройки, условия использования.\n\n— Что поменяется: вместо логина (как в Яндексе) у вас будет почта или телефон. Пароль тоже можно обновить.\n\n— Сейчас нужно: войти в аккаунт Яндекса, где есть кошелёк.

# Wallet.Authorization.migrationScreenTitle
source: Why do I need to switch?
ru: Зачем куда-то переходить?

# Wallet.Authorization.userAgreementTitle
source: By clicking this button, I confirm that I'm aware of <a href="https://yoomoney.ru/page?id=525698%5C">all the legal terms and conditions of the service</a> and I accept them as well as the fact that if I don't enable notifications to my email address or phone number, my transaction history in the YooMoney app or on the website will be the only available source of information
ru: Нажимая кнопку, я подтверждаю осведомлённость и согласие <a href=\"https://yoomoney.ru/page?id=525698%5C\">со всеми юридическими условиями</a> и с тем, что если я не подключу информирование об операциях на почту или телефон, единственным каналом информирования будет история моих операций — на сайте и в приложении ЮMoney

# Wallet.Authorization.userWithEmailAgreementTitle
source: By clicking this button, I confirm that I'm aware of <a href="https://yoomoney.ru/page?id=525698%5C"> all the legal terms and conditions of the service</a>
ru: Нажимая кнопку, я подтверждаю осведомлённость и согласие <a href=\"https://yoomoney.ru/page?id=525698%5C\">со всеми юридическими условиями</a>

# Wallet.savePaymentMethod.title
source: Link a wallet
ru: Привязать кошелек

# YooMoney.title
source: YooMoney
ru: ЮMoney
